In [ ]:
#import library
import pandas as pd

In [ ]:
#read dataset
dataset_url = "https://github.com/datagy/pivot_table_pandas/raw/master/sample_pivot.xlsx"
df=pd.read_excel(dataset_url)

In [ ]:
df.head()

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [ ]:
df.describe

<bound method NDFrame.describe of           Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   18.0    306
1   2020-09-23  North  Children's Clothing   14.0    448
2   2020-04-02  South     Women's Clothing   17.0    425
3   2020-02-28   East  Children's Clothing   26.0    832
4   2020-03-19   West     Women's Clothing    3.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   35.0    735
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   13.0    208
998 2020-08-23  South     Women's Clothing   17.0    493
999 2020-08-17  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]>

In [ ]:
#Creating a Pivot Table by aggregating the Sales values by the Region the sale took place 
pivot_1= pd.pivot_table(df, index = 'Region', values = 'Sales')
pivot_1

             Sales
Region
East    408.182482
North   438.924051
South   432.956204
West    452.029412

In [ ]:
# to return the sum of all Sales across a region,
total_by_region = pd.pivot_table(df, index = 'Region', values = 'Sales', aggfunc='sum')
total_by_region

         Sales
Region
East    167763
North   138700
South    59315
West     61476

In [ ]:
#Filtering Python Pivot Tables that generates the mean Sale price by Region
avg_region_price = pd.pivot_table(df, index = 'Region', values = 'Sales')
avg_region_price

             Sales
Region
East    408.182482
North   438.924051
South   432.956204
West    452.029412

In [ ]:
#filter the dataframe to only include Regions where the average sale price was over 450,
avg_region_price[avg_region_price['Sales'] > 450]

             Sales
Region
West    452.029412

In [ ]:
#creating a pivot table by aggregating the unit values by the Region the sale took place
pivot_2 = df.pivot_table(index = ["Region"],values = ['Units'],aggfunc='sum')
pivot_2

         Units
Region
East    8110.0
North   4359.0
South   2798.0
West    2624.0

In [ ]:
#creating a pivot table by aggregating the type by the Region the sale took place
pivot_3 = df.pivot_table(index = ["Region"],values = ['Type'],aggfunc='sum')
pivot_3

                                                     Type
Region
East    Children's ClothingChildren's ClothingWomen's ...
North   Children's ClothingWomen's ClothingChildren's ...
South   Women's ClothingWomen's ClothingWomen's Clothi...
West    Women's ClothingMen's ClothingWomen's Clothing...

In [ ]:
#concatenating 2 pivot tables vertically
vert_table= pd.concat([pivot_2,pivot_3], axis = 1 , ignore_index=True)
vert_table

             0                                                  1
Region
East    8110.0  Children's ClothingChildren's ClothingWomen's ...
North   4359.0  Children's ClothingWomen's ClothingChildren's ...
South   2798.0  Women's ClothingWomen's ClothingWomen's Clothi...
West    2624.0  Women's ClothingMen's ClothingWomen's Clothing...

In [ ]:
#merging the 2 pivot tables 
all_data = pd.merge(pivot_1, pivot_2, 'left',on = ["Region"] ) #use keys from left object
all_data

             Sales   Units
Region
East    408.182482  8110.0
North   438.924051  4359.0
South   432.956204  2798.0
West    452.029412  2624.0